#include<stdio.h>

int main() {
    int n;
    scanf("%d", &n); // অ্যারের সাইজ ইনপুট নেওয়া হচ্ছে

    int arr[n]; // অ্যারে ডিক্লেয়ার করা হচ্ছে, সাইজ n

    // অ্যারের উপাদান ইনপুট নেওয়া হচ্ছে
    for(int i = 0; i < n; i++) {
        scanf("%d", &arr[i]);
    }

    int pos;
    scanf("%d", &pos); // মুছে ফেলার জন্য পজিশন ইনপুট নেওয়া হচ্ছে

    // পজিশন থেকে ডানদিকে সমস্ত উপাদান সরানো হচ্ছে
    for (int i = pos; i < n - 1; i++) {
        arr[i] = arr[i + 1];
    }

    n--; // অ্যারের সাইজ কমিয়ে দেওয়া হচ্ছে

    // আপডেট করা অ্যারেটি প্রিন্ট করা হচ্ছে
    for (int i = 0; i < n; i++) {
        printf("%d ", arr[i]);
    }
    
    return 0;
}
